{"id":"777", "text":"FREE Mattress with Trinell Kids Bed* Exclusions Apply    .     Living Room Price Cuts   .     Your Choice Queen Beds $199* Exclusions Apply. For local pricing. Please Enter Zip Code. Sign In. Account. Orders. 0. Departments. Today's Deals. Search Catalog. Start typing.  then use the up and down arrows to select an option from the list. SEARCH. Furniture.   Living Room Furniture. Sofa & Couches. Loveseats. Living Room Sets. Sectional Sofas. Sleeper Sofas. Custom Upholstery. Power Seating. Futons. Recliners. Accent Chairs. End & Side Tables. Coffee Tables. Console Tables. Accent Storage Cabinets. TV Stands & Entertainment Centers. Shop Now. Bedroom Furniture. Beds. Headboards. Nightstands. Chest of Drawers. Dressers. Mirrored Dressers. Bedroom Sets. Kids Furniture. Mattresses. Shop Now. Kitchen & Dining Room Furniture. Dining Room Tables. Dining Chairs. Bar Stools. Dining Storage. Bar Furniture. Dining Benches. Dining Sets. Shop Now. Home Office. Desks. Bookcases. Desks Chairs. Lighting. Shop Now. Entryway. Entryway Tables. Entryway Storage. Benches. Runner Rugs. Chandeliers. Shop Now. Room Packages. Living Room Sets. Bedroom Sets. Dining Room Sets. Kids Sets. Shop Now. Bathroom. Bathroom Vanities. Bathroom Storage. Bathroom Mirrors. Shop Now. More Ways to Shop. HomeStore Specials. Small Spaces. Large Spaces. . Mobile apps. Get To Know Us. About Ashley HomeStore. Our History. About Ashley Furniture Industries. Careers. News. Social Responsibility. Store Locations. Trade Program. Customer Care. Help Center. Contact Us. Apply for Financing. Returns. Accessibility. Consumer Notifications. FAQ. Price Match. Child Safety. Warranty Information. Product Care & Cleaning. Get Inspired. Schedule an Appointment. Blog. Home Ideas. 3D Room Design. Hope to Dream. United States. © Ashley Home Stores.  Ltd..  2019. All Rights Reserved. Offers & Details* Terms & Conditions Terms of Use Privacy Policy Interest-Based Ads Personal Information & Use. Sign up to receive our latest deals and get a 10% off coupon.. Ships to:. PAKISTAN. Account. Lists. 0. Cart. Furniture. Rugs. Decor. Bed & Bath. Home Improvement. Kitchen. Outdoor. Jewelry. Apparel. Kids & Baby. More. Ideas. Sales & Deals. Home Goods/. Furniture. Featured Categories. Living Room Furniture. Patio Furniture. Bedroom Furniture. Dining Room Furniture. Kitchen Furniture. Mattresses. Home Office Furniture. Kids' & Baby Furniture. Bathroom Furniture. Small Space Furniture. Entryway Furniture. Handmade Furniture. Recreation Room. Home Gym. Shop All Furniture on Sale. Furniture. save an. extra 25% on. Select Furniture*. Shop Now. Dorm Room. Reform. Looking for. Inspiration? >. Popular Furniture Categories. Living Room Furniture. Dining Room Furniture. Bedroom Furniture. Small Space Furniture. Entryway Furniture. Patio Furniture. Kitchen Furniture. Kids & Baby Furniture. Mattresses. Home Office Furniture. Bathroom Furniture. Handmade Furniture. Types of Home Furniture. Whether you're furnishing a new space or updating your old one.  getting familiar with the home furnishing options available to you will help you find the perfect additions for your space.. Learn More. Multifunctional Furniture for Small Spaces. Whether you live in a studio apartment or a small dorm room.  multifunctional furniture is the perfect way to make the most of the space you have.. Learn More. Shop More Furniture. Sofas & Couches. Sectional Sofas. Living Room Sets. Accent Tables. Loveseats. Accent Chairs. Dining Sets. Dining Tables. Dining Chairs. Buffets. Bar Stools. Beds. Bedroom Sets. Headboards. Chests & Dressers. Nightstands. Kids' & Toddler Beds. Shop All Furniture on Sale. MY ACCOUNT. Orders & Returns. Email Preferences. Account Settings. Alerts & Communications. LET US HELP. Contact Customer Care. Shipping Information. Return Policy. International Help. COMPANY INFORMATION. About Overstock™. Careers. Sell Your Products. Overstock™ Investor Relations. Overstock™ Supply Chain Transparency. MORE WAYS TO SHOP. Tips & Ideas. Deals. Clearance. New Arrivals. © Copyright 1999-2019.  Overstock.com.  Inc.. 799 Coliseum Way Midvale.  UT 84047 .  1-800-843-2446. Privacy Policy. Terms & Conditions. *Promotion Terms. Ship to:. happy hosting! 20% OFF FURNITURE.  DÉCOR & MORE shop details. English ($). Sign In / Sign Up. New!. Dresses. Clothing. Plus. Shoes. Accessories. Home & Furniture. Beauty & Wellness. Sale. Gifts. Home & Furniture Furniture. Browse by:. Furniture. Living Room. Sofas. Sectionals. Chairs. Leather Seating. Chaise Lounges & Daybeds. Coffee Tables. End Tables. Benches.  Poufs & Ottomans. Bookcases & Shelving Units. Consoles & Media Storage. Seating Collections. Bedroom & Storage Collections. Bedroom. Beds & Headboards. Nightstands. Dressers & Armoires. Kitchen & Dining Room. Tables. Chairs.  Benches & Stools. Bar Carts & Cabinets. Buffets & Sideboards. Small Space Furniture. Small Space Dining Tables. Small Space Seating. Small Space Coffee & End Tables. Small Space Storage & Dressers. Bathroom Vanities. Office. Entryway Furniture. Custom Furniture. Customer Favorites. Home Services. Outdoor. Living Room. Seating Collections. Sofas. Sectionals. Chairs. Coffee Tables. Consoles & Media Storage. End Tables. Benches.  Poufs & Ottomans. Bookcases & Shelving Units. Bedroom. Beds & Headboards. Dressers & Armoires. Nightstands. Kitchen & Dining Room. Chairs.  Benches & Stools. Tables. Buffets & Sideboards. Other Spaces. Small-Space Furniture. Office. Bathroom Vanities. More to Explore. Featuring all you need to know to make yourself at home.. . read more. Ready to refresh your space?. . schedule a complimentary consultation today. We have a bed for every slumber and a place for every treasure.. . see what's new. Unique & Modern Furniture: An Ode to Furnishing Your Home. Whether you’re looking to outfit your entire home.  or one small room at a time.  our curated furniture collection has all of the focal points and essentials you desire. All in the most delectable fabrics.  finest wood grains.  and beautiful colors. Plus.  with custom options.  if you don’t find exactly what you’re looking for.  we’ll help you build it.. For an extra dose of interior design help.  we’ve compiled these do’s to help bring your wildest decor dreams to life.. Mix modern and traditional elements.. A vintage styled headboard with modern crisp sheets.  a bold new bar cart displaying flea market finds.  or a hand-me-down desk lamp atop a brand new desk. The most design savvy among us know that mixing eras and price points is an easy way to make a house feel like a home.. Let focal points shine.. Go bold with an oversized upholstered headboard. Let your TV stand speak for itself. Choose the sectional sofa that will fit your entire family. It’s okay to let one piece dominate your entire room if you love it enough.. Invest in special pieces.. Close your eyes and picture yourself in your favorite room in your home. Are you lounging on living room furniture.  hosting dinner on your dining table.  reading from bookcases in your room? Wherever you are.  make sure you invest in that space. Go for cozy furniture that will make you feel at home.. Embrace your favorite colors.. Don’t go for neutrals because they “go with everything”. If you love a color enough.  it can work with any existing sofas.  accent chairs or wood furniture you have with the right home decor pieces to tie them together. Find artwork or new nicnacs for your shelves that include your colors of choice.. Simplify cluttered spaces.. Remember the cardinal rule of storage and shelving. Tuck it away if it’s not needed today. Let your coffee tables.  nightstands and credenzas breathe and boast their fine wood grains. This is especially true for small spaces.. Include unexpected fabric and texture.. Colors aren’t the only way to mix and match. Choose couches in rich velvets.  leathers and suede to add depth of texture. These visual layers play with our senses and add delight to any living room or bedroom.. Create special nooks.. If you have a large space.  consider breaking it down into multiple vignettes. A space to sit and talk with friends.  a place to relax.  and a place to work. With so many couches.  office decor and accessories to choose from.  you’ll want every room to be multi-functional.. Embrace the rule of threes.. Pair a pouf with a table and plant. Sit an upholstered chair atop a rug.  with a floor lamp. Adorn a nightstand with a lamp.  vase and your favorite book. You get the idea: Pairings in odd numbers are the antidote to expectations.  yet the most visually appealing pairing.. Sign Up For Anthropologie Emails. Plus.  hear about the latest and greatest from our family of brands!. EMAIL ADDRESS*. SUBMIT. By signing up.  you will receive Anthropologie offers.  promotions and other commercial messages. You are also agreeing to Anthropologie’s Privacy Policy. You may unsubscribe at any time.. sign up for email. find a store. Help. track your order. returns. shipping. customer service. About Us. our story. events. brands. Services. anthroperks. gift cards. to the trade. furniture guide. Connect. contact us. careers. styling services. request a catalog. Follow Us. US France Germany UK. Privacy Policy Terms of Use CA Notice Accessibility URBN.com. Skip to main content. EN.   Hello.  Sign in. Account & Lists. Orders. Cart. 0. Furniture. Furniture. All Departments. Arts & Crafts. Automotive. Baby. Beauty & Personal Care. Books. Computers. Digital Music. Electronics. Kindle Store. Prime Video. Women's Fashion. Men's Fashion. Girls' Fashion. Boys' Fashion. Deals. Health & Household. Home & Kitchen. Industrial & Scientific. Luggage. Movies & TV. Music.  CDs & Vinyl. Pet Supplies. Software. Sports & Outdoors. Tools & Home Improvement. Toys & Games. Video Games. Go. Deliver to. Pakistan. Today's Deals. Your Amazon.com. Gift Cards. Help. Registry. Sell. . . Back to top. Get to Know Us. Careers. Blog. About Amazon. Investor Relations. Amazon Devices. Amazon Tours. Make Money with Us. Sell on Amazon. Sell Your Services on Amazon. Sell on Amazon Business. Sell Your Apps on Amazon. Become an Affiliate. Advertise Your Products. Self-Publish with Us. ›See More. Amazon Payment Products. Amazon Business Card. Shop with Points. Reload Your Balance. Amazon Currency Converter. Let Us Help You. Your Account. Your Orders. Shipping Rates & Policies. Returns & Replacements. Manage Your Content and Devices. Amazon Assistant. Help. English $USD - U.S. Dollar United States. Amazon Music. Stream millions. of songs Amazon Advertising. Find.  attract.  and. engage customers Amazon Drive. Cloud storage. from Amazon 6pm. Score deals. on fashion brands AbeBooks. Books.  art. & collectibles ACX. Audiobook Publishing. Made Easy Alexa. Actionable Analytics. for the Web.   Amazon Business. Everything For. Your Business AmazonGlobal. Ship Orders. Internationally Home Services. Handpicked Pros. Happiness Guarantee Amazon Inspire. Digital Educational. Resources Amazon Rapids. Fun stories for. kids on the go Amazon Web Services. Scalable Cloud. Computing Services Audible. Listen to Books & Original. Audio Performances.   Book Depository. Books With Free. Delivery Worldwide Box Office Mojo. Find Movie. Box Office Data ComiXology. Thousands of. Digital Comics CreateSpace. Indie Print Publishing. Made Easy DPReview. Digital. Photography East Dane. Designer Men's. Fashion Fabric. Sewing.  Quilting. & Knitting.   Goodreads. Book reviews. & recommendations IMDb. Movies.  TV. & Celebrities IMDbPro. Get Info Entertainment. Professionals Need Kindle Direct Publishing. Indie Digital Publishing. Made Easy Prime Video Direct. Video Distribution. Made Easy Shopbop. Designer. Fashion Brands Woot!. Deals and. Shenanigans.   Zappos. Shoes &. Clothing Ring. Smart Home. Security Systems eero WiFi. Stream 4K Video. in Every Room Neighbors App. Real-Time Crime. & Safety Alerts Subscribe with Amazon. Discover & try. subscription services PillPack. Pharmacy Simplified Amazon Second Chance. Pass it on.  trade it in. . give it a second life. Conditions of UsePrivacy NoticeInterest-Based Ads© 1996-2019.  Amazon.com.  Inc. or its affiliates. HOME FACTREE. RegistrationLog InContacts. HOME. CHECKOUT. CART. APPOINTMENT. CONTACTS. .. HOME COLLECTION. MODERN FURNITURE SHOP IN PAKISTAN. You can now easily buy online furniture from Islamabad .  Rawalpindi .  Lahore .  Karachi or anywhere in Pakistan. Home Factree helps you choose new and modern design furniture for your home or office in promising price range and best quality. Subscribe to news feed to get notified about all flash sales and discounts.. For booking an appointment click here.. Contact : 03488910092      .      Location : Islamabad/Pakistan. Showing 1–6 of 107 results.      Sort by popularity.      Sort by average rating.      Sort by latest.      Sort by price: low to high.      Sort by price: high to low.     ?145. 000.00. CLEMEN SOFA COLLECTION. ADD TO CARTDETAILS. Sale!. ?77. 500.00 ?58. 500.00. ORTIC CORNER SOFA. ADD TO CARTDETAILS. ?82. 000.00. PIKH BED SET. ADD TO CARTDETAILS. Sale!. ?9. 000.00 ?6. 000.00. STRIPE OTTOMAN SEAT. ADD TO CARTDETAILS. Sale!. ?90. 000.00 ?75. 000.00. CHESTERFIELD SOFA 5.... ADD TO CARTDETAILS. Sale!. ?38. 000.00 ?28. 000.00. ROKU LOVE SEAT. ADD TO CARTDETAILS. Filter by price. FILTER. Price: ?3. 000 — ?195. 000. Product Categories. Accent Furniture. Chairs. Bed. Consoles. Cupboards. dinning. Mirror. Ottoman. Shelves. Sofa Sets. Tables. Uncategorized. FOLLOW US ON FACEBOOK FOR LATEST OFFERS. ON SALE!. Ortic Corner Sofa. ?77. 500.00. ?58. 500.00. Stripe Ottoman seat. ?9. 000.00. ?6. 000.00. RECENT PRODUCTS REVIEWS. Grey Sectional Sofa. ?65. 000.00. Luigi Couch. ?35. 000.00. ?24. 000.00. ABOUT STORE. Where modern meets style .  we bring you contemporary design furniture that will transform your place into a unique home. We help you choose color and schemes that best suit your theme and personality. Visit us to see our exemplary work. Custom designs for home and offices are also available upon request. . READ MORE. FOLLOW US ON FACEBOOK. HomeFactree. Civic Center Opp Reliance Hospital .  Phase 4 .  Bahria Town.. Islamabad. Tel 0348-8910092. Email contact@homefactree.com. HOME FACTREE. At home factree.  we want you to discover the joy of creating masterpieces for your home.We want you to think of the setting up of a space as an energizing.  creative pursuit. To breathe life into empty rooms with your ideas. To take a few square feet of nothing.  and transform it into something beautiful. In short we want you to be the designer of your own home.Our dedicated team of talented furniture designers.  skilled craftsmen & marketing professionals end goal is to serve each customer’s furniture needs with 100% satisfaction. The team hails from diverse backgrounds with expertise at each level from customer support.  furniture crafting to innovative product development. Our experience & dedication is to leverage every process from design to sales & installation process.So either you are going for imported office furniture in lahore or index furniture in karachi .  our furniture store offers prices lower than olx furniture market and better quality than any showroom furniture designs.. Facebook. Email or Phone Password. Forgotten account?. Furniture Hub. @fhfurniturehub. Home. Posts. Photos. Community. About. Create a Page. Like. Share. Send Message. See more of Furniture Hub on Facebook. Log In. or. Create New Account. Furniture Hub. Furniture in Lahore.  Pakistan. Open now. ABOUT FURNITURE HUB. Furniture Hub. House of modern furniture and interior. The Company's products are marketed as wood residential hom.... See more. Community. See all. 120. 903 people like this. 121. 376 people follow this. About. See all. Cavalry ground near khalid masjid Lahore cantt Lahore.  Pakistan (5.81 km). 54000 Lahore.  Pakistan. Get Directions. 0301 4267878. Contact Furniture Hub on Messenger. Furniture · Interior design studio · Home decor. Impressum. Hours 11:00 - 21:00. Open now. Page transparency. See More. Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content.. Page created – 3 February 2017. People. 120. 903 likes. Related Pages. Walnut Furniture. Furniture. CrownFurnishers. Home decor. Furniture Line. Furniture shop. JJ Furniture Chiniot. Furniture. Stylish Furniture. Furniture. See more. triangle-down. PlacesLahore.  PakistanOtherHome decorFurniture Hub. English (UK) · ???? · ???? · ??????? · Español. Privacy · Terms · Advertising · AdChoices. · Cookies ·. More. Facebook © 2019. Posts. Furniture Hub. 23 July ·. #Luxury Goldleaf high gloss bedroom set. #FurnitureHub call for visit 0301-4267878. #furniture #Interior #Royal #Lahore. 123. 123. 16 comments. 4 shares. Like. Comment. Share. Furniture Hub added 19 new photos to the album #Furniture Hub — in Lahore.  Pakistan.. 21 July ·. We are delighted to be able to introduce our exclusive collection of custom-made furniture. These items are constructed from modular sections meaning you are able to create the exact furniture that will fit perfectly. into your home.??. To order please visit us or contact us at:. ??: 0301-426-7878.... See more. #Furniture Hub. 19 photos. 264. 264. 2 comments. 17 shares. Like. Comment. Share. See all. Photos. See all. See more. Facebook. Email or Phone Password. Forgotten account?. Kalamkaar. @KalamkaarOfficial. Home. Posts. Reviews. Videos. Photos. About. Community. Welcome. Locations. Instagram. Twitter. Contact Us. Create a Page. Like. Share. Call Now. Send Message. See more of Kalamkaar on Facebook. Log In. or. Create New Account. Kalamkaar. Furniture in Lahore.  Pakistan. 4.5. 4.5 out of 5 stars.. Community. See all. 1. 148. 729 people like this. 1. 149. 069 people follow this. About. See all. 0321 8453611. www.kalamkaar.com. Furniture. Page transparency. See More. Facebook is showing information to help you better understand the purpose of a Page. See actions taken by the people who manage and post content.. Page created – 27 November 2014. People. 1. 148. 729 likes. Related Pages. Aarish Furnitures. Furniture. Versstil. Furniture. Chiniot furniture. Furniture. Stylish Furniture. Furniture. Qalamkar. Apparel & clothing. See more. triangle-down. Pages liked by this Page. Kalamkaar Textile. Daairah. Hn Solutions. PagesOtherBrandFurnitureKalamkaar. English (UK) · ???? · ???? · ??????? · Español. Privacy · Terms · Advertising · AdChoices. · Cookies ·. More. Facebook © 2019. Posts. Kalamkaar. 19 June ·. All our showrooms are now open on Sundays!. #Kalamkaar #FurnitureAsArt. Kalamkaar. Furniture. Send Message. 7.2K. 7.2K. 143 comments. 73 shares. Like. Comment. Share. Kalamkaar. 2 hrs ·. Refined elegance punctuated with meticulous craftsmanship.  our culturally inspired Zavia Sofa Set and Elephant Center Table will look fabulous in a variety of decors.. #Kalamkaar #FurnitureAsArt. 412. 412. 14 comments. 11 shares. Like. Comment. Share. See all. Recommendations and reviews. Recommended by 40 people. its awesome but you should  mention price with your product.it will save your time and people can ea... See more. 2 September. quality.  delicacy with strength.  style .  traditional yet modern. 22 August. Dear kalamkaar. .  It's been 7 years now. still waiting for somebody to get back to me.ive left a couple.... . . .  See more. 30 June 2017. See All. Videos. Kalamkaar. 2.4K. 157. Kalamkaar. 1.4K. 74. Kalamkaar opens at Packages Mall.. 1K. 139. See all. See more. The Pillow Shop .  Buy One.  Get One 25% OFF. FREE Shipping Over $49*. Room Ideas. Sale. Shop Our Sites. My Account & Orders. Sign In. Lists. Cart. Furniture. Bed & Bath. Rugs. Décor & Pillows. Outdoor. Storage. Lighting. Kitchen. Baby & Kids. Renovation. Appliances. Pet. Holiday. Registry. Furniture. Living Room Furniture. Bedroom Furniture. Kitchen & Dining Furniture. Accent Furniture. Office Furniture. Entry & Mudroom Furniture. Outdoor & Patio Furniture. Bathroom Furniture. Bar Furniture. Baby & Kids Furniture. Game Tables & Game Room Furniture. Pet. Unfinished Furniture. Mirrored Furniture. Small Spaces. Custom Furniture. Shop Furniture. Furniture Sale . Living Room Furniture. Sofas.  Sectionals & Loveseats. Living Room Sets. Chairs & Recliners. Accent Chairs. Coffee Tables & Coffee Table Sets. Ottomans & Poufs. Bedroom Furniture. Beds. Bedroom Sets. Dressers. Headboards. Nightstands. Accent Chairs. Kitchen & Dining Furniture. Kitchen & Dining Room Sets. Kitchen & Dining Tables. Kitchen & Dining Chairs. Bar Stools. Sideboards & Buffets. Kitchen Islands & Carts. Accent Furniture. Accent Chairs. Accent Tables. Cabinets & Chests. Blanket Ladders & Racks. Benches. Ottomans & Poufs. Office Furniture. Desks. Office Chairs & Seating. Office Sets. Bookcases. Filing Cabinets. Office Storage Cabinets. Entry & Mudroom Furniture. Console & Sofa Tables. Hall Trees. Cabinets & Chests. Storage Benches. Shoe Storage. Wall Hooks & Coat Racks. Outdoor & Patio Furniture. Outdoor Seating & Patio Chairs. Outdoor Tables. Patio Furniture Sets. Patio Bar Furniture. Small Space Patio Furniture. Outdoor Umbrellas. Bathroom Furniture. Bathroom Vanities. Bathroom Storage. Makeup Vanities. Vanity Stools. Bathroom Fixtures. Showers & Bathtubs. Bar Furniture. Bar Stools. Bar Table Sets. Pub Tables. Bar Furniture Sale. Bars & Bar Sets. Bar & Wine Cabinets. Baby & Kids Furniture. Kids Playroom. Kids Bedroom Furniture. Nursery Furniture. Baby & Kids Furniture Sale. Game Tables & Game Room Furniture. Pool Tables & Accessories. Poker Tables & Accessories. Shuffleboard. Table Tennis Tables & Accessories. Multi Game Tables. Classic Game Tables. Pet. Dog. Cat. Chicken. Other Pets. Bird. Pet Furniture Sale. Unfinished Furniture. Unfinished Dining Chairs. Unfinished Desks. Unfinished Coffee Tables. Unfinished Bar Stools. Unfinished TV Stands. Unfinished Nightstands. Mirrored Furniture. Mirrored Cabinets & Chests. Mirrored Console Tables. Mirrored End Tables. Mirrored Nightstands. Mirrored Coffee Tables. Mirrored Sideboard & Buffet Tables. Small Spaces. Small Space Living Rooms. Small Space Bedrooms. Small Space Kitchens. Small Space Offices. Small Space Patio Furniture. Small Space Bathrooms. Custom Furniture. Custom Sofas. Custom Sectionals. Custom Sleepers. Custom Loveseats. Custom Accent Chairs. Custom Recliners. Shop Furniture. Furniture Sale. Furniture. When it comes to furnishing your home.  finding the perfect furniture that is both stylish and functional is one of the best parts about owning a home. You can let your inner interior designer flourish sorting through all the decoration options.  deciding on how to blend colors.  patterns.  and materials. With such variety in home furniture.  it's important to know the differences between these styles and materials so you can find what works best for you. For instance.  will Victorian furniture fit in with your design if you want to create a vibrant room with bright colors and contrasting highlights? Or does it make more sense to use a brighter theme and utilize coastal furniture to accomplish your goals? We'll try to go over all these details here so you can get on your way to finding the best home furniture for you.. Read More. Login  .   Create An Account. 0. Home. Products. Projects. FAQ. About Us. Contact Us. 1. 2. 3. 4. 1. 2. 3. 4.          Category .  .                    Tables.                                             Chairs.                                             More Products Range.                                             Seating.                                            .           Furniture .           Search. New Products. All. Table. Chair. Other Products. Shop More. Featured Products. SS-ULTRA. PKR. 14500. SS-FLASH. PKR. 11500. SS-COLUMBUS. PKR. 14500. Our Clients. STATE OF THE ART LIBRARY. Mid City Hospital. MDS FOODS PVT LTD. hi Tech Lubricants. . . LOCATE US. 10-A Wahdat Road.  Muslim Town. Lahore.  Pakistan.. Email: info@barrysfurniture.com.pk. Call Us: 042-35887531 042-35885322. FEATURED CATEGORIES. Seating. Tables. Chairs. More Products Range. MY ACCOUNT. My account. Personal information. Sale Items. Order History. FACEBOOK LIKE BOX. Â© 2019 Barry's Furniture. All Rights Reserved.. FIND LOCAL SALES. Living Room. Dining Room. Bedroom. Mattress. Kids. Home Decor. Rugs. Tips. Living Room. Bedroom. Kids. Dining Room. Mattress. Home Decor. A better way to shop for furniture.. Online Furniture Shopping. Never spend days looking for a single couch or dining room table again. Instead.  take advantage of the opportunity to browse thousands of quality pieces in one place. We've curated an impressive selection of beds.  coffee tables.  dining sets.  sectionals.  sofas.  recliners.  accessories and more.  so.  you can rest assured that you'll find exactly what you want in no time. Get nice.  affordable furniture from trusted local retailers by shopping with us.. Diverse Brands & Styles in One Place. We make it easy to find the furniture you're looking for by offering a wide selection of different brands and styles. Furniture.com features a variety of home furnishings made by leading names in the furniture industry. we provide choices when it comes to decorating your home. Whatever type of design you're going for.  you will find right here.  at your first stop for online furniture shopping.. Buy Furniture with Ease. Have you ever spent days trying to put together a room.  or had trouble finding the perfectly sized dresser? Our site is exactly what you need!. . Furniture.com aggregates quality furniture in a convenient.  easy-to-browse website. Design your space from the comfort of your home. Find a sectional that fits your family with ease.  a loft bed for your studio apartment or a accent cabinet showcasing your best china. Chances are.  we have what you are looking for. Our selection is tasteful yet diverse.  spanning a range of the market's current furniture options. Order at your convenience.  So.  start clicking to put together the home of your dreams - it's that easy.. . Looking for local deals and discounts? Check out our furniture sales page and find store near you.. Need Help?. Visit Our Help Center. Call Us. 1-855-277-0614. Email Us. customerservice@furniture.com. FIND LOCAL SALES. BROWSE. LIVING ROOM. DINING ROOM. BEDROOM. MATTRESS. KIDS. HOME DECOR. SALES. COLLECTIONS. INFORMATION. ABOUT US. PRIVACY POLICY. TERMS OF USE. TERMS OF SALE. CALIFORNIA PRIVACY POLICY. CONTACT US. TIPS & TRENDS. TIPS & TRENDS BLOG. SHOP BY COLOR. SHOP BY STYLE. Welcome! Furniture.com is only available within the United States and its territories. If you are looking for items available for local delivery to you.  please visit:. A better way to shop online for furniture.  home décor and so much more!. Take me to Furniture.ca. SIGN IN / JOIN. WORLD MARKET REWARDS. SELECT STORE. Free Shipping On EVERY Order $75+. Apply Code: WMFS75 Details. . . . . MY CART 0. INSPIRATION. SHOP BY ROOM HALLOWEEN. Furniture. Outdoor. Rugs. Lighting. Decor & Pillows. Bed & Bath. Dining. Kitchen. Food & Drink. Jewelry & Clothing. Gifts. Holidays. Sale. HOME FURNITURE. Furniture. We travel the world to find traditional.  contemporary and modern furniture to bring a sophisticated.  eclectic look to your living room.  bedroom.  dining room and more. Outfit your home with new and unique furniture.  at an affordable price.. New Furniture. Dining Room Furniture. Living Room Furniture. Home Office Furniture. Bedroom Furniture. Custom Furniture. Small Spaces Collection. Artisan Furniture. Entryway Furniture And Décor. Bathroom Furniture. Mid Century Furniture. Industrial Collection. Farmhouse Collection. Outdoor Furniture. Shop The Room. Shop All Furniture. Articles. Shop By Room. READ MORE. Small Space Tips. READ MORE. You May Also Like. Previous. Sana Brass Mirror. $169.99. $135.99. Natural Wood Leaning Full Length Floor Mirror. $199.99. $159.99. Large Round Natural Wood Wall Mirror. $149.99. $119.99. . . . . Next. Slide: 1. 1. Slide: 2. 2. Slide: 3. 3. Slide: 4. 4. Explore our assortment of home furniture sourced from around the globe to discover eye-catching headboards and bedroom sets.  polished and practical sofas.  bold chairs and other living room furniture.  and even traditional wood furniture for your dining room. With our affordable designs.  it's easy to refresh your home with quality furniture. Looking for inspiration? We even made it easy with our Shop by Room look books.. . Browse our multicultural decorative pieces from our assortment of accent furniture. Shop for unique knick-knacks for a college dorm room or the collector in your life. Transform your bedroom into your sanctuary with our wide selection of twin.  full.  queen.  king and California king bed frames. Find premium quality and craftsmanship with our home furniture and tie the room together with our stylish wall decor and curtains. Live in a small space? No problem.  our small space living guide is your new best friend!. . View More. HOME FURNITURE. NEW FURNITURE. DINING ROOM FURNITURE. +. LIVING ROOM FURNITURE. +. HOME OFFICE FURNITURE. +. BEDROOM FURNITURE. +. CUSTOM FURNITURE. +. SMALL SPACES COLLECTION. +. ARTISAN FURNITURE. ENTRYWAY FURNITURE AND DÉCOR. BATHROOM FURNITURE. MID CENTURY FURNITURE. INDUSTRIAL COLLECTION. FARMHOUSE COLLECTION. OUTDOOR FURNITURE. SHOP THE ROOM. SHOP ALL FURNITURE. Get 15% Off Your Purchase. Join World Market Rewards for exclusive coupons & perks.. JOIN NOW. Cost Plus World Market. Mastercard Credit Card. Special Financing Available *. GET MORE DETAILS & APPLY. Follow Us:. . . . . . . . . . . . . . . . . . About World Market. About Us. Careers. Site Map. Affiliates. Safety.  Security.  Privacy. Terms And Conditions. As Seen In. #DISCOVERWORLDMARKET. Store Events. Customer Service. Track My Order. Returns & Exchanges. Shipping & Delivery. Payment. Contact Us. Product Recalls. Gift Card Balance. Buy Online. Free Pick Up in Store.. Ways To Save. World Market Rewards. Designer Discount. World Market Coupons. World Market Credit Card. Always A Deal. Contact Us. 1-877-967-5362. Email Us. MY OFFERS. 4 AVAILABLE.   APPLY CODE. DETAILS. SHOP NOW. SHOP NOW. JOIN NOW. Visit Our Other Sites:. . Feedback. Will open a new window. . Sign up for emails & get an extra 25% off Sign Up Now. We now ship to 200 locations worldwide Details. Macys-logo. ORDER TRACKING STORES WEDDING REGISTRY SHIPPING TO. SHOP BY DEPARTMENT. Opens QuickBag Flyout. This category/brand is currently unavailable for international shipping.. . Customer Service. Help & FAQs. Order Tracking. Shipping & Delivery. Returns. Contact Us. Shipping To go to U.S. site. Our Stores. Find a Store. Visitor Services. Visitor Shopping Pass. Tell Us What You Think. Macy's Backstage. Personal Stylist. Macy's Inc.. Corporate Site. About Macy's. Press Room. Investors. Green Living. Macy's Gives. Macy's App. Download_on_the_App_Store_Badge_US-UK_RGB_blk_4SVG_092917 .st0{fill:#A6A6A6;} .st1{fill:#FFFFFF;stroke:#FFFFFF;stroke-width:0.2;stroke-miterlimit:10;} .st2{fill:#FFFFFF;} .st3{fill:url(#SVGID_1_);} .st4{fill:url(#SVGID_2_);} .st5{fill:url(#SVGID_3_);} .st6{fill:url(#SVGID_4_);} .st7{opacity:0.2;enable-background:new ;} .st8{opacity:0.12;enable-background:new ;} .st9{opacity:0.25;fill:#FFFFFF;enable-background:new ;}. Email & Notifications Signup. Apply for card. Star Rewards signup. Facebook. Instagram. Twitter. Pinterest. Youtube. This Web Accessibility icon serves as a link to download eSSENTIAL Accessibility assistive technology software for individuals with physical disabilities.. Easy web browsing for visually impaired customers. © 2019 macys.com is a registered trademark. All rights reserved. Macys.com.  LLC.  680 Folsom St. San Francisco.  CA 94107. Macy's Credit and Customer Service.  PO Box 8113.  Mason.  Ohio 45040. Request our corporate name & address by email.. Privacy Notice .  Interest Based Ads .  CA Privacy Rights .  Legal Notice .  Customer Bill of Rights .  CA Transparency in Supply Chains .  Product Recalls .  Pricing Policy .  Site Map. Fall Dining Event. Lighting Event. Fall Outdoor Event. Bedroom Showcase. Free Shipping Over $79. GALLERY. BLOG. Furniture. Outdoor. Home Decor. Lighting. Bed & Bath. Kitchen. Baby & Kids. Pets. Storage. Holidays. More. Rooms. Styles. Sale. HayneedleFurniture. home furniture. SHOP BY CATEGORY. Living Room. Bedroom. Kitchen & Dining. Accent. Office. Entertainment. Entry & Mudroom. Bar. Bathroom. Kids. Outdoor. MORE WAYS TO SHOP. Shop All Rooms. Shop All Styles. OUR EXCLUSIVE BRANDS. MoDRN. Belham Living. Finley Home. Drew Barrymore Flower Home. SHOP FURNITURE BY. On Sale. Clearance. New Products. Quick Shipping. Belham Living Frances Dining Chair - Set of 2.  5 Reviews. $285.10. $304.18. Belham Living Olivia Round Bar Cart.  68 Reviews. $122.40. $160.76. Mobital Trestle Dining Table. $1. 359.00. Crosley Aimee Glass Etagere.  17 Reviews. $217.80. $302.39. SEE MORE FROM THIS LOOK. Top Furniture Categories.  Sofas & Loveseats. Accent Chairs. Ottomans. Coffee Tables.  Bar Stools. Dining Tables. Bookcases. Beds. SHOW MORE . Shop Furniture by Room. . . Living Room. Bedroom. Dining Room. Home Office. Shop by Style & See What You Love. . . Farmhouse Furniture. Modern Furniture. Mid-Century Furniture. Rustic Furniture. More Furniture you might be interested in. Viewing 1 - 48 of 72. 105 results. Sort By. Name (A to Z). Name (Z to A). Price (Low to High). Price (High to Low). Best Selling. Quick Shipping. Customer Rating. Preferred. Belham Living Braxton Bar Cart. $16600. $259.20Save 36%. Limited-time sale! - Ends Oct 14. Free Shipping.   118. #REDU091. . Belham Living Grayson Tufted Coffee Table Ottoman. $16680. $185.64Save 10%. Sale. Free Shipping.   65. #DIME008. Belham Living Carter Mid Century Modern Writing Desk. $24890. $285.34Save 13%. Sale. Free Shipping.   120. #REDU040. . Belham Living Bethany Round Back Counter Stool. $21280. $236.16Save 10%. Sale. Free Shipping.   13. #LHD1494. Belham Living Newberry Corner Bakers Rack. $17570. $201.78Save 13%. Sale. Free Shipping.   102. #ALZ258. Belham Living Carlisle Mini Mission Hall Tree. $23779. $279.75Save 15%. Sale. Free Shipping.   45. #DIME039. Belham Living Holden Modern Indoor Rocking Chair - Upholstered - Buttercream. $19231. $272.05Save 29%. Sale. Free Shipping.   52. #ALZ875. Boraam Augusta 34 in. Swivel Extra Tall Bar Stool. Starting At. $14180. Save up to 17%. Limited-time sale! - Ends Oct 14. Finish: 2 available. Free Shipping.   64. #BOR367. Brixton Indoor/Outdoor Folding Bakers Rack. $13870. Free Shipping.   177. #PSM224. . . . . Remmington Heavy Duty Bookcase - Cherry. Starting At. $12090. Save up to 25%. Sale. Size: 5 available. Free Shipping.   179. #DIME016. . . Belham Living Merced Platform Cart Bed. Starting At. $30820. Save up to 19%. Sale. Bed Size: 3 available. Free Shipping.   45. #RN1816. . Belham Living Trenton Bar Cart - Espresso. $15054. $272.38Save 45%. Limited-time sale! - Ends Oct 14. Free Shipping.   74. #REDU051. Belham Living Corbett Round Coffee Table Storage Ottoman. $19972. $267.39Save 25%. Sale. Free Shipping.   60. #REDU024. Remmington Heavy Duty Bookcase - White. Starting At. $11120. Save up to 37%. Sale. Size: 6 available. Free Shipping.   132. #DIME018. . . . Belham Living Bartlett Console Table. $14540. $206.70Save 30%. Sale. Finish: 1 available. Free Shipping.   101. #CHIS034. Belham Living Winston Tufted Swivel Counter Stool. Starting At. $16380. Save up to 18%. Limited-time sale! - Ends Oct 14. Color: 2 available. Free Shipping.   29. #MEIY044. Belham Living Carter Mid-Century Modern Bar Cart. $14630. $219.00Save 33%. Limited-time sale! - Ends Oct 14. Free Shipping.   33. #REDU050. Finley Home Palazzo Extra Tall Bar Stool - Set of 2. Starting At. $17594. Save up to 24%. Limited-time sale! - Ends Oct 14. Color: 4 available. Free Shipping.   82. #REDU141. . Belham Living Hutton Arched Cube Nailhead Ottoman. Starting At. $6925. Save up to 31%. Sale. Color: 6 available.   214. #REDU057. Belham Living Allover Round Tufted Ottoman - Grey. $10480. $119.99Save 13%. Sale. Free Shipping.   129. #MEIY002. Townsend Bakers Rack. $21906. $257.72Save 15%. Limited-time sale! - Ends Oct 14. Free Shipping.   163. #ALZ531. Belham Living Hutton Backless Counter Stool. Starting At. $6020. Save up to 37%. Limited-time sale! - Ends Oct 14. Seat Color: 8 available.   640. #REDU061. Belham Living Newport 34 in. Extra Tall Bar Stool. Starting At. $14220. Save up to 22%. Limited-time sale! - Ends Oct 14. Color: 2 available. Free Shipping.   15. #REDU170. Boraam Bristol Leather 29 in. Swivel Bar Stool. Starting At. $11230. Save up to 25%. Limited-time sale! - Ends Oct 14. Finish Color: 4 available. Free Shipping.   296. #BOR209. Boraam Augusta 3 Piece Pub Table Set - Cappuccino. $35469. Free Shipping.   82. #BOR138. Belham Living Portica Corner Bakers Rack. $23100. Free Shipping.   106. #ALZ629. Belham Living Nursery Rocker - Gray. $11119. $169.99Save 35%. Sale. Free Shipping.   25. #LIV036. Belham Living Carter Mid Century Modern Upholstered Dining Chair - Set of 2. Starting At. $20950. Save up to 30%. Limited-time sale! - Ends Oct 14. Seat Color: 5 available. Free Shipping.   77. #REDU083. Weston Home Factory Bookcase. $16821. $230.14Save 27%. Sale. Free Shipping.   171. #HME2179. Boraam Augusta 29-in. Swivel Bar Stool. Starting At. $8920. Save up to 11%. Sale. Finish Color: 3 available. Free Shipping.   1039. #BOR049. Belham Living Windsor Rocking Chair - Oak. $12197. $152.46Save 20%. Sale. Free Shipping.   33. #LIV035. Hudson 16-Cube Shelf with Desk - White. $24840. $304.99Save 19%. Sale. Free Shipping.   45. #STIP012. Remmington Heavy Duty Bookcase - Oak. Starting At. $10230. Save up to 29%. Sale. Size: 6 available. Free Shipping.   113. #DIME017. . Finley Home Redford Corner Bookcase. Starting At. $17010. Save up to 23%. Sale. Color: 4 available. Free Shipping.   74. #DIME051. Belham Living Province Mission Rocker - Walnut. $20110. $253.02Save 21%. Sale. Free Shipping.   105. #ALZ873. Belham Living Hutton Modern Round Nailhead Ottoman. Starting At. $7075. Save up to 21%. Sale. Color: 5 available.   139. #REDU058. Belham Living Hutton Backless Bar Stool. Starting At. $5957. Save up to 64%. Limited-time sale! - Ends Oct 14. Seat Color: 8 available.   192. #REDU060. Belham Living Thomas Tufted Tweed Dining Chairs - Set of 2. Starting At. $19460. Save up to 59%. Limited-time sale! - Ends Oct 14. Color: 2 available. Free Shipping.   61. #MEIY033. Meco Sudden Comfort Deluxe Double Padded Chair and Back - 5 Piece Card Table Set - Chicory. $15840. $191.66Save 17%. Limited-time sale! - Ends Oct 14. Free Shipping.   129. #MEC013. Morgana Tufted Counter Stool. Starting At. $7980. Save up to 23%. Limited-time sale! - Ends Oct 14. Color: 3 available. Free Shipping.   133. #CTY1435. Barcalounger Charleston Leather Push Back Recliner - Black. $34410. $462.23Save 26%. Sale. Free Shipping.   13. #BRCA179. Belham Living Winston Tufted Swivel Bar Stool. Starting At. $16510. Save up to 17%. Limited-time sale! - Ends Oct 14. Color: 2 available. Free Shipping.   23. #MEIY043. . Morgana Tufted Parsons Dining Chair - Set of 2. Starting At. $11470. Save up to 24%. Limited-time sale! - Ends Oct 14. Color: 3 available. Free Shipping.   202. #CTY1431. Belham Living Richland Mini Hall Tree - Espresso. $22099. $259.99Save 15%. Sale. Free Shipping.   98. #DIME005. Belham Living Hampton Console Table 2 Shelf Bookcase - White/Oak. $24610. $310.26Save 21%. Sale. Free Shipping.   217. #DONR017. Boraam Augusta 24 in. Swivel Counter Stool. Starting At. $8640. Save up to 14%. Sale. Finish Color: 3 available. Free Shipping.   850. #BOR048. Belham Living Newport Backless Counter Stool. Starting At. $6715. Save up to 33%. Limited-time sale! - Ends Oct 14. Finish: 2 available.   91. #REDU098. Belham Living Hutton Extra Tall Bar Stool. Starting At. $12371. Save up to 27%. Limited-time sale! - Ends Oct 14. Finish: 6 available. Free Shipping.   56. #REDU163. 1234...1503. Next. home rewards. Join now and earn 5% in rewards on every order.. JOIN FOR FREE. Already a member? Sign In. Rewards for. Purchases. Rewards for. Reviews. Members-Only. Sales. Learn more. All About Furniture. Hayneedle can furnish thousands of examples of how our home furniture selection is second to none. But we want to do more than that. We also want to furnish your imagination with the latest furniture trends and ideas for your bedroom.  dining room.  and living room that will go beyond just the ordinary!. . Some people might call that thinking outside the box. We prefer to call it thinking inside the home. At hayneedle.com.  we make thoughtful home decorating possible by providing more and better traditional and contemporary home furniture options for kitchens.  dining rooms.  bedrooms.  living rooms.  bathrooms.  foyers - in short.  every room.  nook.  and hallway that you call home.. . Our furniture selection emphasizes quality.  uniqueness.  and value.  and includes numerous collections exclusive to Hayneedle. Online furniture shopping is web surfing. But browsing for home furniture at Hayneedle? That's a voyage of discovery.. . Our entryway furniture pieces introduce unexpected elegance and space-saving organization where foot traffic is heaviest. Practical and handsome.  wood furniture pieces such as benches.  bookcases.  coat racks.  and hall trees transform front rooms and foyers into charming preludes of the decor to come.. . The family room is the heart of the home.  and the heart of Hayneedle's extensive home furniture selection.  including modern living room furniture and chairs. Today's family rooms and living rooms are more versatile than ever before.  and Hayneedle has options for every family's lifestyle.  from a classic sofa or couch to entertainment centers and home theater seating.. . Home decorators are rediscovering the aesthetic possibilities of dining room furniture and kitchen furniture.  such as chic bistro sets and bar stools or a counter-height dining table and chairs and rustic furniture. Broaden your furniture palate with a peek at our Kitchen & Dining section.. . Discover the style you love most with Hayneedle beds.  dressers.  and other bedroom furniture. It's your room. Indulge your inner designer with luxurious beds in dreamy styles such as platform.  sleigh and canopy.. . Working hard and playing hard is good. But working stylishly and playing comfortably is so much better. Find your life-work balance with Hayneedle home office furniture and game room furniture.. . Whatever the space.  room.  or style.  you'll find everything furniture - and everything home - at hayneedle.com.. Stay updated on special offers.  design trends.  and more.. SIGN UP. ABOUT HAYNEEDLE. Our Story. In The News. Careers. Business Program. Trade Program. CUSTOMER SERVICE. Shipping Options. Order Lookup & Returns. Gift Certificate Look Up. Rewards. Email Preferences. Help Center. CONTACT US. Guest # 2677-52-2544. Customer Service. Mon - Fri. 8 am - 11 pm ET. Sat - Sun. 9 am - 8 pm ET. Sales Assistance. Mon - Fri. 8 am - 11 pm ET. Sat - Sun. 9 am - 8 pm ET. Partner With Us. Site Map. Supplier Login. Privacy Policy. Terms of Use. Gift Certificates. Satisfaction Guarantee. Best Price Guarantee. Interest Based Advertising. Security. CA Transparency in Supply Chains Act. Affiliate Program. Recall Information. Accessibility Policy. Copyright 2002 - 2019.  Hayneedle Inc..  All rights reserved.. skip to main content. skip to footer. Categories. Deals. Trending. Same Day Delivery. my account. Sign in. cart 0 items. Please select a store. Registries & Lists. Weekly Ad. RedCard. Gift Cards. Find Stores. Orders. 0. More. Target/Furniture. No handling fees + free shipping on orders over $35*. Fresh for fall. Soft tonal woods & artisanal-style textures with dark contrasts are totally on trend this season.. Black & Natural Living Room Furniture. Black & Natural Kitchen & Dining Furniture. Crush more fall trends. Color really makes a statement (furniture). Velvet chairs are having a moment. . Shop by category. Furniture Deals. Living Room Furniture. Bedroom Furniture. Kitchen & Dining Furniture. Home Office Furniture. Kids' Furniture. Nursery Furniture. Entryway Furniture. Bathroom Furniture. Furniture Collections. Statement Furniture. Accent Furniture. Desks. Bookshelves & Bookcases. Accent Chairs. TV Stands & Entertainment Centers. Bar & Counter Stools. Sofas & Sectionals. . Shop by brand. Made By Design. Project 62. Opalhouse. Threshold. Pillowfort. Room Essentials. . Decorating inspo for every room. We pulled the whole room together so you don’t have to.. . All Room Ideas. Living Room Ideas. Bedroom Ideas. Dining Room Ideas. Get helpful solutions for your home. Top 6 dining chairs. Find out what dining-room chair styles are the most popular & why.. Small space? No problem.. Be inspired by decorating ideas for small-space living.. Need extra seating?. Explore the different options multifunctional ottomans & benches have to offer.. Share what you got! And see what’s trending.. Post your #TargetStyle & mention @Target in your caption.. . Explore by decor style. Modern. Traditional. Bohemian. Farmhouse. Mid-Century Modern. All Decor Styles. Imagine & discover. Shop using our digital tools. (Yes to it all.). Decorating made easy. See how it looks in your space.  before you commit.  with our augmented reality preview.. Explore our 360° rooms. Find new pieces & see how they come together.. . So many ways to shop & get it all quickly. All Shipping & Services. Free 2-Day Shipping. Order Pickup. Drive Up. GiftNow. Registry. Furniture. Refresh every room in your home for less with furniture that’s on-trend & affordable.  too. Find perfect pieces for large homes.  small spaces.  apartments.  dorms.  studios.  lofts & more. Consider what you’ll need when you walk in the front door. We have entryway furniture like coat racks.  entry tables.  benches and more. Looking for living room furniture? If you’re moving into a new home.  you might like the simplicity of our selection of living room sets. Get one set & you’re almost done.  because everything matches. Easy peasy. If you prefer curating your living room’s look.  start by selecting a couch in your favorite aesthetic. A stylish sofa is the centerpiece of your living space. Pick a matching chair & ottoman to help you kick back. An accent chair is an easy way to add a fun pop of pattern or color to the space. Finish the room with a functional accents like an .  .  .  [/url].  .  & . Need ? Make furnishing your home easy & make it all match with our huge selection of . Done & done. Or pick pieces on your own. Start with a .  .  & . Finish your bedroom with a .  .  or a that offers lots of storage. Your will likely be the heart of your home. We have and .  .  .  .  and .  .  .  and much more. What about the kids’ rooms? Check out the cutest .  & even more .  perfectly sized for the kiddos. In addition to a .  they’d love their own .  or and . Got a mancave or entertainment room? Trick out the space with sweet pieces.  like an . They come in simple or more complex designs. Add a or for the ultimate fun.  casual & cozy zone. Everyone will love hanging out. complete your seating arrangement. A does double duty as extra seating & a crash pad for house guests. Want ? Got it. A is an absolute must. Consider your office space & whether a .  or simple.  basic makes the most sense for your layout. Our selection of will help you find the perfect seat to match your . Finish the space off with & a that does more than store. Display favorite photos.  books.  decor & more to personalize your work space.. Show more. third party advertisement. *See offer details. Restrictions apply. Pricing.  promotions and availability may vary by location and at Target.com.. Help. Stores. Apps. Social. More. RecallsTermsInterest-Based AdsCA Privacy RightsCA Supply Chain ActPrivacy. Privacy updated 10/2019. ™ & © 2019 Target Brands.  Inc.. third party advertisement. Crate and Barrel Store. Crate and Kids Store. Hudson Grace (opens in new tab). CB2 (opens in new tab). Search. Crate and Barrel. Cart contains. 0. items. Furniture. Outdoor. Tabletop & Bar. Kitchen. . Decor. Rugs. Lighting. Bed & Bath. Holidays & Gifts. Sale. Inspiration. Furniture. New Furniture. Living Room Furniture. Sofas. Sectional Sofas. Sleeper Sofas. Accent Chairs. Chaise Lounges & Daybeds. Ottomans & Cubes. Benches. Coffee & Accent Tables. TV Stands & Media Consoles. Game Room Furniture. Dining & Kitchen Furniture. Dining Tables. Dining Chairs. Bar Stools. Chair Cushions. Dining Benches. Buffets & Sideboards. Kitchen Islands & Carts. Bar Carts & Bar Cabinets. Storage & Modular Furniture. Modular Storage Collections. Storage Cabinets. Bookcases & Shelves. Storage Benches & Ottomans. Bedroom Furniture. Beds & Headboards. Dressers & Chests. Nightstands. Armoires. Mattresses & Box Springs. Bedroom Benches. Cribs & Bassinets. Kids Beds. Mirrors. Design Space. Small Spaces. Commercial Furniture. Home Office Furniture. Desks. Office Chairs. Office Bookcases. Filing Cabinets & Credenzas. Kids Desks & Desk Chairs. Entryway Furniture. Chests & Cabinets. Entryway Tables. Entryway Benches. Entryway Decor. Top Rated Furniture. Living Room. Because life’s better together.. Dining Room. Scene of dinner party triumphs.. Bedroom. Where you rest.  read.  unwind.. Storage. Clutter’s not part of the plan.. Office. Deadlines: met. Inbox: zero.. this room’s. big day. Get set for the feast with clean. . modern tables and chairs for. hosting a holiday crowd.. where happy. guests rest. . . . . . SMALL SPACE STYLE. . . @LISALOOKSUP. @MY_BDESIGND_LIFE. @NIKKI.LAZARO. #CRATESTYLE. better in real life. See and shop customer photos.  plus share your own. Follow us on Instagram @crateandbarrel.. Crate Design Studio. Tell us your vision or show us your room. Our experts are full of ideas.  and it’s free.. Make a Moodboard. You like this.  you love that. But how will it all look together? Find out here.. Plan Your Sectional. Create a sofa that works for you. Drag and drop to get the shape and dimensions just right.. Unlimited Furniture Delivery. Go big and go home. Fill our truck with everything you need for one flat fee per trip.. Living Room. Sofas. Living Room Chairs. Coffee Tables. TV Stands & Consoles. Show more. Dining Room & Kitchen. Dining Tables. Dining Chairs. Bar Stools. Kitchen Islands & Carts. Show more. Bedroom & Office. Beds & Headboards. Dressers & Chests. Nightstands & Tables. Desks. Show more. Styles & Materials. Modern. Contemporary. Mid Century Modern. Wicker. Show more. Related Categories. Wood Pine Tables. Upholstered Furniture. Home Entertainment Furniture. Hallway Furniture. Reclaimed Wood Tables. Walnut Furniture. CONTEMPORARY FURNITURE FOR THE HOME. Discover the perfect blend of design and function with furniture that suits your individual taste and complements your life. Whatever your style—modern.  rustic or traditional—find sofas.  loveseats.  tables and more. Decorate any room of your house.  apartment.  townhouse or condo with home furnishings in materials that blend with existing decor.Create a comfortable family room with living room furniture that works as hard as you do. Curl up on the couch with a good book or play a board game on the coffee table. Add side tables and media consoles to hold your drinks and your electronics. Want more seating for parties or big families? Consider a sectional sofa.  extra chairs or even ottomans to make the most of your space.  and learn how to arrange furniture to discover more ideas. To increase the lifespan of your furniture.  look for long-wearing and durable materials.  including solid wood.  leather and upholstery.We spend a third of our lives sleeping.  so it's important to find bedroom furniture that helps us rest and recharge. Easily store clothing.  bed linens and other necessities in dressers.  nightstands and armoires. A wood or metal bed frame provides traditional appeal and supports a quality mattress and boxspring set. For a modern look.  consider an upholstered headboard or a platform bed.Kitchens and dining rooms are often the central hub for the contemporary home. Kitchen carts and islands provide convenient storage and extra surface area for preparing meals. Create a cohesive aesthetic for dinner parties and meals at home with dining sets.  including tables.  buffets and sideboards. Add seating with dining chairs and benches. Looking for custom design? Create your own dining table by mixing and matching tabletops and bases until you find the perfect fit for your space.Use high-quality furniture to showcase your individual style in home offices.  entryways and hallways. Place a console table and a bench in the entryway to give guests a place to remove their shoes and set keys.  packages or purses. Configure a home office with desks.  cabinets and bookshelves that offer storage and the ability to work from home. To easily rearrange the room at a moment's notice.  choose furniture with casters.. Contact Us. Send us an email. Call (00+1) 630.369.4464. Mon - Fri: 8 am - 8 pm CT. Sat - Sun: 8 am - 7 pm CT. Order Tracking. Find out when your online purchase will arrive.. Track Your Order. Our Company. About Us. Careers. Social Responsibility. Store Locations and Events. Resources. Customer Service. Product Recalls. Accessibility Statement. Social Media. Facebook (opens in a new tab). Twitter (opens in a new tab). Pinterest (opens in a new tab). Instagram (opens in a new tab). Youtube (opens in a new tab). Houzz (opens in a new tab). Show us your look with:. #CrateStyle. #CrateKidsStyle. Crate and Barrel. ©2019 Crate and Barrel. All rights reserved. Terms of Use Privacy Site Index Ad Choices Accessibility Statement. If you are using a screen reader and are having problems using this website.  please call (00+1) 630.369.4464 for assistance.. Access Denied. You don't have permission to access on this server.. Reference #18.985532b8.1570623971.39291a99. ue935. ue907. All Departments. ue943. ue908. ue90d. ue901. Account. ue905. Stores. ue902. Skip Header. Up to 30% off. Enjoy falling prices on furniture in our Savings Center. Set the stage for cozy movie nights & festive fall gatherings with savings on stylish sofas.  chairs.  media centers.  & more.. pause slide animation. slide 1 of 3.  active. slide 2 of 3.  Activate to move to this slide. slide 3 of 3.  Activate to move to this slide. All Things Home. Shop by Room. Shop by Style. Furniture. Kitchen & Dining. Appliances. Bed & Bath. Patio & Garden. Home Decor. Storage & Organization. Home Savings. Furniture. Skip To Next Section. Shop by Category. Bedroom Furniture. - use alt shift right arrow to open the sub menu. Living Room Furniture. - use alt shift right arrow to open the sub menu. Kitchen & Dining Furniture. - use alt shift right arrow to open the sub menu. TV Stands & Entertainment Centers. - use alt shift right arrow to open the sub menu. Small Space Furniture. - use alt shift right arrow to open the sub menu. Office Furniture. - use alt shift right arrow to open the sub menu. Mattresses & Accessories. - use alt shift right arrow to open the sub menu. Kids' Furniture. - use alt shift right arrow to open the sub menu. Special Offers. Rollbacks. Clearance. New. Only at Walmart. Popular Categories. Beds. Desks. TV stands. Dining room sets. slide 1 of 3.  active. slide 2 of 3.  Activate to move to this slide. slide 3 of 3.  Activate to move to this slide. Shop Furniture by Room. Living Room. Kitchen & Dining Room. Bedroom. Kids' Room. slide 1 of 2.  active. slide 2 of 2.  Activate to move to this slide. Gather together. Fall decor.  hosting needs.  & more.. Shining accents.  dining needs.  & more.. Furniture.  harvest decor.  & more.. New from MoDRN. Bedroom Furniture. Accent Furniture. Dining Room Furniture. Shop by Style. Farmhouse. Traditional. Mid-Century. Modern. slide 1 of 3.  active. slide 2 of 3.  Activate to move to this slide. slide 3 of 3.  Activate to move to this slide. What to look for when shopping for furniture. Beautiful home decor starts with the basics: your furniture. That's why it's important to purchase pieces that last. Knowing what and what not to look for can help make your furniture shopping experience quick and easy. Consider these helpful tips when choosing furnishings for all your living spaces—indoors and out.. See More. Sign Up. ue95e. ue95c. ue95d. ue95f. ue961. ue91f. Mobile apps. Walmart Services. Grocery Pickup & Delivery. MoneyCenter. Walmart Credit Card. Walmart Pay. Weekly Ad. Other Services. Get to Know Us. Our Company. Digital Museum. Our Suppliers. Sell on Walmart.com. Advertise With Us. Careers. Walmart.com. Walmart Labs. Our Ads. Terms of Use. Privacy & Security. Calif. Privacy Rights. Tax Exempt Program. Customer Service. Help Center. Returns. Product Recalls. Accessibility. Contact Us. Store Pickup. In The Spotlight. Ellen's List. Electronics. Toys. Video Games. Home Products. Clothing. Shop Our Brands. © 2019 Walmart. All Rights Reserved.. To ensure we are able to help you as best we can.  please include your reference number: VZWW771N4J. ue930. Feedback. Access Denied. You don't have permission to access http://www.homedepot.com/b/Furniture/N-5yc1vZc7pc on this server.. Reference #18.47f57468.1570623980.304c3dd2. We Are Currently Unable to Provide a Shopping Experience for This Country. Please try again later. Please verify you are a human. Access to this page has been denied because we believe you are using automation tools to browse the website.. This may happen as a result of the following:. Javascript is disabled or blocked by an extension (ad blockers for example). Your browser does not support cookies. Please make sure that Javascript and cookies are enabled on your browser and that you are not blocking them from loading.. Reference ID: #0182cb90-ea90-11e9-88b8-817ab447da33. Powered by PerimeterX .  Inc.. WHY AT HOME?. GET TO KNOW THE SUPERSTORE. Your Store: Massachusetts-Dedham. (change). Find A Store My Account. Departments. Styles. Rooms. New. Ideas. Clearance. Flash Find. Holiday HQ. Search. Home. Departments. Furniture. FURNITURE. Filters. Clear All. Category. Departments. Furniture. Living Room. Bedroom. Dining Room. Office. Patio. Accent Furniture. New Arrivals. New. Price. $0 - $20. $20 - $50. $50 - $100. $100 - $200. $200 - $300. $300 - $400. $400 - $500. Over $500. Style. Modern/Contemporary. Glam. Boho Chic. Rustic/Farmhouse. Traditional. What You Can Find:. Shop all of the furniture you need to simply refresh or completely refurnish your home. We have all styles of furniture including coastal.  boho.  modern and farmhouse-inspired. Explore sofas.  accent chairs.  desks.  tables.  benches.  headboards.  patio furniture and more all at everyday low prices.. JOIN. INSIDER PERKS. 10% Off Welcome Offer. Birthday Bonus. Receiptless Returns. and More!. JOIN NOW. LIVING ROOM. BEDROOM. DINING ROOM. OFFICE. PATIO. ACCENT FURNITURE.   (Showing 1 - 24 of 1. 923 Results). Shanty2Chic Tapered Blanket Ladder. $69.99. Foundation Mattress. $99.99 - $199.99. Chesterfield Velvet Tufted Sofa.  Grey. $599.99. Northfield 3-Door Distressed Cabinet. $279.99. YARA LOUNGE CHAIR GREY. $299.99. Celine Swivel Counter Stool.  24. BEST PRICE EVERY DAY. $129.99. Kori Chair.  Dark Blue. $299.99. Aubrey Folding Dining Table. $299.99. ARYA SOFA DARK GREY. $399.99. Maximalist Modern Corner Chair with Gold Base.  Navy Blue. $249.99. Vivek Chaise.  Grey/Silver. $399.99. Luka Counter Stool.  Light Brown. $99.99. Sherry 2-Drawer 2-Door Cabinet. $299.99. CHASE UPHOLSTERED CHAIR. $149.99. KENZIE VELVET COUNTER STOOL. NEW. $129.99. Frost Deconstructed Chair. NEW. $179.99. Reclaimed Wood Table.  71. NEW. $399.99. Nomi Velvet Swivel Chair.  Grey. $279.99. Berkeley Rattan Headboard.  65. $149.99. Channeled Bench.  Grey. NEW. $129.99. Scenario Side Table. CLEARANCE. $59.99 $37.49. ROBERTO SOFA BED. NEW. $599.99. MADDEN VELVET DINING CHAIR GRE. NEW. $79.99. Sage Frost Display Console Table. NEW. $189.99. VIEW MORE. (Showing 1 - 24 of 1. 923 Results). Whether you want to spruce up your dining room.  living area or are looking to put the finishing touches on a spare bedroom.  At Home has the home furniture selection you need to do the job and to do the job well. From sofas and chairs to accent tables and cabinets.  At Home has over 3. 000 items from which to choose.  making it one of the most varied and versatile home furniture collections. Find the pieces you need to complete the home office.  or elevate your living room with signature pieces that offer comfort and sophistication. Take advantage of items from one of the most affordable furniture and home décor stores.  and find home furniture that reflects your design aesthetic and personality.. . ENJOY 10% OFF. your next visit.  a birthday bonus and. insider info with At Home Insider Perks™. JOIN NOW. ABOUT. About Us. Habitat for Humanity. Corporate Responsibility. Investor Relations. Careers. QUICK LINKS. Explore Departments. Explore Styles. Explore Rooms. Get Ideas. Gift Cards. SUPPORT. Contact Us. Product Partner Login. FAQs. Product Safety. Terms of Use. Privacy Policy. CREDIT CARD. Apply. Learn More. CONNECT WITH US. Follow us on Facebook Follow us on Twitter Follow us on Instagram Follow us on Pinterest Subscribe to our YouTube channel. The similar styles price noted is our researched retail price at a point in time of similar style of aesthetic item at another retailer offering home décor products. Like other home décor retailers.  we work with a variety of partners to source our products.  making each one unique to At Home. Copyright © 2019 At Home Stores LLC. Selection.  quantities and pricing of products may vary by participating store. All rights reserved.. October Furniture Sale .  Shop Now. Place any order.  get 30 days free shipping!. Room Ideas. Shop Our Sites. My Account & Orders. Sign In. Lists. Cart. Holiday. Furniture. Outdoor. Decor & Pillows. Lighting. Rugs. Bedding & Bath. Home Improvement. Kitchen & Tabletop. Sale. Furniture. FEATURED CATEGORIES. Living Room Furniture. Bedroom Furniture. Kitchen & Dining Room Furniture. Accent Furniture. Entryway & Hallway Furniture. Home Office Furniture. Outdoor Furniture. Baby & Kids. Pet Furniture. Custom Upholstery. New Furniture. Furniture Sale. Exclusive Pricing. Brand to Love: Caracole. Shop Now!. Featured Categories. Living Room Furniture. Bedroom Furniture. Kitchen & Dining Room Furniture. Accent Furniture. Entryway & Hallway Furniture. Home Office Furniture. Outdoor Furniture. Baby & Kids. Pet Furniture. Custom Upholstery. New Furniture. Furniture Sale. Loading today’s best sellers…. Furniture. One great thing about a home is that you have the ability to make every room unique. If you want to have a sophisticated and traditional bedroom.  but like the fun aspect of a playful and vibrant living room.  you can do just that. After all.  it's your own personal space to do with as you please. Not only is Joss & Main here to offer you a variety of furniture selections to choose from.  but also to offer you some great style advice. Here are some staples you want to have in each room.. For the living room.  organization should be the focus. In this room.  you want to find thoughtful pieces that can keep all your items housed together neatly. This level of increased organization makes the room look better and also makes your time spent in the room more convenient. Console pieces are great furniture options for this room.. In the kitchen.  it's all about creating a stylish and functional space. In this room.  look for furniture options that overachieve in each of these areas. For example.  in a kitchen with an island.  choosing unique bar stools that offer a convenient place to sit made in a stylish design are the way to go.. In the bedroom.  keep comfort the priority. After a long day at work.  being able to retreat to your bedroom for a little peace and relaxation is ideal. Furniture selections in this space should be plush and inviting. Upholstered beds are great for sending this message.. When it comes to outfitting your home.  remember that it is all about you. This idea is true whether you're talking about the kitchen.  dining room.  bedroom or any other space in the home. With these design tips.  you can find the furniture pieces you need to make your house your own.And with such a large collection of options.  after a quick browse on the Joss & Main site.  you'll learn that it's easy to find exactly what it is you're looking for.. Read Less. Related Searches. armless accent chairs. floral accent chairs. acrylic dining chairs. velvet sectional sofas. green dining chairs. tufted beds. Don't miss a steal.. Score up to 70% off stylish finds every day.. Email Address. CONTINUE. You can change your email preferences at any time.. Read our privacy policy.. No.  thanks.. Get Financing. .st0 { fill: #FFFFFF; } .st1 { fill: #181818; }. Order Tracking. .st0 { fill: #FFFFFF; } .st1 { fill: #181818; } Pin_Icon Small black pin. Location:. 41042. . . . .st0 { fill: #FFFFFF; } .st1 { fill: #181818; } Page 1 Heart. Wishlist. .st0 { fill: #FFFFFF; } .st1 { fill: #181818; }. Sign in. LIVING ROOM. DINING ROOM. BEDROOM. MATTRESSES. KIDS. ACCENTS. INSPIRATION. SALE. Your Shop All Furniture Results (2187). BROWSE BY:. CATEGORY. Living Room (1315). Bedroom (880). Accents (790). Dining Room (457). Kids (163). Mattresses (99). Outdoor (23). FILTER BY:. TYPE. COLOR OR FINISH. MATERIAL. PRICE. WIDTH (INCHES). FEATURES. SALE. EXCLUSIVES. Sort: Best Match. 48 Items Per Page. 1. 2. 3. .... 46. $1. 779.93. $1. 629.93 after $150 Off. Charthouse Rectangular Dining Table and 6 Upholstered Side Chairs. More Options Available: Color. $199.99. Plush Dining Chair. $1. 299.98. Milan 2-Piece Sofa. More Options Available: Color. Was $2. 799.93. Today $2. 099.93. Athena Dining Table with 4 Side Chairs and 2 Host Chairs. $1. 299.99. Brittney Sofa. More Options Available: Color. $699.99. Ella Upholstered Bed. More Options Available: Mattress Size.  Color. $1. 099.95. Artemis Counter-Height Dining Table and 4 Upholstered Stools. More Options Available: Color. $2. 999.95. $2. 699.95 after $300 Off. Plush 5-Piece Sectional. By Kroehler. +35. More Options Available: Color. $1. 399.97. Cordelle 2-Piece Sectional with Chaise and Cocktail Ottoman Set. More Options Available: Color.  Orientation. $1. 299.97. Mackenzie 2-Piece Sectional and Ottoman Set. More Options Available: Color.  Orientation. Was $3. 999.95. Today $3. 399.96. Happy 5-Piece Dual-Power Reclining Sectional with Chaise and 3 Reclining Seats. More Options Available: Color.  Orientation. $3. 249.95. $2. 949.95 after $300 Off. Reflection 4-Piece Entertainment Center with Fireplace. More Options Available: Configuration. $599.99. Galleria Coffee Table. $599.99. Reflection Coffee Table. $1. 199.99. Wave Dual-Power Reclining Sofa. More Options Available: Color. $699.99. Artemis Marble Dining Table. $99.99. Artemis Dining Chair. More Options Available: Color. $399.00. Artemis Bench. More Options Available: Color. $1. 099.99. Brittney Chaise. More Options Available: Color. $1. 699.97. $1. 549.97 after $150 Off. Garrett 3-Piece Sectional. By Kroehler. More Options Available: Color. $1. 299.97. Ashton 3-Piece Sectional with Cuddler. By Kroehler. More Options Available: Color.  Orientation. $899.99. West End 2-Piece Sectional with Chaise. More Options Available: Color.  Orientation. $1. 199.95. Rio 5-Piece Sectional with 3 Corner Chairs - Gray. Was $2. 999.96. Today $2. 549.97. Winston 4-Piece Sectional with Chaise. By Kroehler. +36. More Options Available: Color.  Orientation.  Cushion. $698.00. Ricardo 2-Piece Sectional. By Kroehler. More Options Available: Color.  Orientation. $999.98. Cordelle 2-Piece Sectional with Chaise. More Options Available: Color.  Orientation. $998.00. Brando 3-Piece Sectional with Modular Chaise. More Options Available: Color. $799.98. Chatman 2-Piece Sleeper Sectional with Chaise. More Options Available: Color.  Orientation. Was $2. 699.96. Today $2. 294.97. Happy 4-Piece Dual-Power Reclining Sectional with 2 Reclining Seats and Cuddler. More Options Available: Color. $1. 499.94. $1. 349.94 after $150 Off. Turbo 6-Piece Manual Reclining Sectional with 3 Reclining Seats. More Options Available: Color. Was $2. 399.94. Today $1. 999.94. Mario 6-Piece Dual-Power Reclining Sectional with 3 Reclining Seats. More Options Available: Color. $3. 699.94. $3. 399.94 after $300 Off. Newport 6-Piece Dual-Power Reclining Sectional with 3 Reclining Seats. More Options Available: Color. $2. 799.94. $2. 649.94 after $150 Off. Dartmouth 6-Piece Dual-Power Reclining Sectional with Chaise and 2 Reclining Seats. More Options Available: Color.  Orientation. $3. 099.95. $2. 799.95 after $300 Off. Catalina 5-Piece Dual-Power Reclining Sectional with 2 Reclining Seats. More Options Available: Color. $2. 199.94. $2. 049.94 after $150 Off. Orlando 6-Piece Power Reclining Sectional with 3 Reclining Seats. More Options Available: Color. Was $2. 399.94. Clearance $2. 199.94. Big Softie 6-Piece Power Reclining Sectional with Chaise and 2 Reclining Seats. More Options Available: Color.  Orientation. $2. 099.93. $1. 949.93 after $150 Off. Diablo 7-Piece Power Reclining Sectional with Armless Power Chair. $3. 099.94. $2. 799.94 after $300 Off. St. Malo 6-Piece Power Reclining Sectional with Chaise and 2 Reclining Seats. More Options Available: Color.  Orientation. $199.99. Arlo 5-Piece Pub Set. $2. 259.93. $2. 109.93 after $150 Off. Angelina Double-Pedestal Table.  Two Arm Chairs and 4 Side Chairs - Metallic. $298.00. Nantucket Drop-Leaf Table and 2 Slat-Back Chairs. More Options Available: Color. $1. 234.00. Vienna Dining Table.  6 Side Chairs and 2 Upholstered Side Chairs - Merlot. $1. 499.93. $1. 349.93 after $150 Off. Esquire Table and 6 Chairs - Cherry. $1. 279.93. Cosmo Dining Table and 6 Upholstered Chairs. $778.00. Britto 6-Piece Bedroom Set with 3-Drawer Chest.  Dresser and Mirror. More Options Available: Mattress Size. $1. 499.97. $1. 349.97 after $150 Off. Sabrina 6-Piece Bedroom Set with Nightstand.  Dresser and Mirror. More Options Available: Mattress Size.  Color. $997.00. Toronto 6-Piece Storage Bedroom Set with Nightstand.  Dresser and Mirror. More Options Available: Mattress Size. $697.00. Mosaic 6-Piece Bedroom Set with Nightstand.  Dresser and Mirror. More Options Available: Mattress Size. Sort: Best Match. 48 Items Per Page. 1. 2. 3. .... 46. OFFERS & FINANCING.   *Promotions and discounts are not valid towards MSRP Mattresses (Beautyrest Black.  Beautyrest Hybrid).  Door Busters.  Top Deals.  previous purchases.  gift cards.  delivery charges.  or Pure Promise. Not combinable with 36 month financing.. SHOP WITH ASF. Find a Store. Weekly Circular. Easy Pass. Financing Options. Manage My Signature Plus Card. Best Sellers. New Arrivals. What's On Sale. GET TO KNOW US. About Us. Careers. FAQs. CUSTOMER CARE. (888) 751-8553. Contact Us. Track My Order. Refunds and Exchanges. FOLLOW US. Subscribe for special offers.  discounts.  and promotions. SIGN UP. . . @ Copyright 2019 American Signature.  Inc. All Rights Reserved.     Site Map .  Privacy Policy .  Terms & Conditions     Powered by Blueport Commerce. . . . . . . . . . . . . Connect with a Specialist. Skip To Main Content. Skip To Department Navigation. Store Finder. Email Sign Up. Help. search. Hello.  Sign In. My Account. Shopping Cart. 0. Store Locator. Find a Store Near You:. Please Choose Store. SHOP DEPARTMENTS. DEALS. . . . WEEKLY AD. BIG REWARDS®. Free ship* at $59! Details + 15% Off** EVERYTHING Details. Home. Featured. New Arrivals. Furniture. FURNITURE. Filter Results. Availability. Show All. Color. Brand. Price. Price Cut. Customer Reviews. Available In store at. Please Choose Store. Featured. Showing 1 - 99 of 224 Products. View All. Lane Home Solutions Brighton Gray Faux Leather Motion C.... 1. $699.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Brighton Gray Faux Leather Motion S.... 1. $699.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Sterret Walnut Satin Plated 1-Drawer Nightstand. $219.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Sauder Autumn Cherry 3-Shelf Storage Cubby. 1. $32.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Lukey Weathered Oak & Chrome Coffee Table. $299.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Sauder Autumn Cherry 9-Cube Storage Cubby. $39.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Sauder Autumn Cherry 6-Cube Storage Cubby. $29.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acacia Wooden Log Top Side Table. $59.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Sauder Autumn Cherry 5-Shelf Storage Cubby. $49.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Mango Wood & Metal Round Nested 2-Piece Accent Table Se.... $69.99 Reg. $99.99. Save  $30.00 (30%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Octagonal Mango Wood Side Table. $41.99 Reg. $59.99. Save  $18.00 (30%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Snyder Chrome & Wood Coffee Table. $279.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Sauder Soft White 9-Cube Storage Cubby. 1. $39.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Square Iron & Wood Geometric Accent Table. $47.99 Reg. $59.99. Save  $12.00 (20%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Sauder Black Oak 9-Cube Storage Cubby. 1. $39.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Sauder Soft White 5-Shelf Storage Cubby. $49.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Sauder Soft White 3-Shelf Storage Cubby. $32.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Sauder Black Oak 6-Cube Storage Cubby. $29.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Weathered Gray Sawhorse Leg Coffee .... $299.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Chandler Antique Adjustable Height .... $179.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Sauder Soft White 6-Cube Storage Cubby. 1. $29.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Sterret Walnut Satin Plated Flush 1-Drawer Nightst.... $279.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Sada Espresso & Black Adjustable Height End Table. $149.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Lukey Weathered Oak & Chrome Square End Table. $179.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Snyder Chrome & Wood Square End Table. $199.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Scarus White Backless Wood & Metal Barstool. $149.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Chamblee Two-Tone Coffee Table. $269.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Chamblee Two-Tone End Table. $129.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Scarus Red Backless Wood & Metal Barstool. $149.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Scarus Gunmetal Backless Wood & Metal Barstool. $149.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Scarus Black Backless Wood & Metal Industrial Bars.... $149.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Ixora Beige Power Lift & Massage Recliner. $499.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Iban Gray Oak & Chrome 1-Drawer End Table. $179.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Waterlily Brown Faux Leather Swivel Rocker Motion .... $499.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Waterlily Black Faux Leather Swivel Rocker Motion .... $499.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Thomas White Metal Twin Bunk Bed. $269.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Thomas Black Metal Twin Bunk Bed. $269.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Jailene Black Leather-Aire Motion Recliner with US.... $699.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Ixia Light Gray Power Lift & Massage Recliner. $499.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Ixia Light Brown Power Lift & Massage Recliner. $499.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Ipompea Gray Velvet Power Lift & Massage Recliner. $609.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Acme Ipompea Black Velvet Power Lift & Massage Recliner. $609.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Java Brown Power Chairside Table. $169.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Vintage Brown Occasional Tables Set.... $299.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Espresso Round Chairside Table. $169.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Weathered Gray Sawhorse Leg End Tab.... $169.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Graphite Gray Console Table. $249.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Tobacco Brown Panel X Barrel Side T.... $149.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Antique Console Table. $399.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Antique Bunching End Coffee Table S.... $399.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Simmons Chrome Occasional Tables.  3-Piece Set. $299.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Walnut Brown Motion Coffee Table. $299.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Java Brown Motion Lift Top Coffee T.... $399.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Graphite Wood & Metal Occasional Ta.... $369.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Tobacco Brown Chairside Table. $99.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Satin Nickel Glass Top &quot;C&quot.... $99.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Tempered Glass & Metal Geometric 3-.... $299.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Mushroom Gray Oval 3-Piece Occasion.... $199.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Rustic Brown Panel X Barrel Side Ta.... $119.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Espresso End Table. $189.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Espresso Caster Wheel Console Table. $269.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Espresso Pedestal Coffee Table. $299.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Pewter Gray C Chairside Table. $99.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Java Brown Drawer End Table. $189.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Espresso Sofa Table. $299.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Lane Home Solutions Espresso Pedestal End Table. $209.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Marble & Acacia Wood C Side Table. $47.99 Reg. $59.99. Save  $12.00 (20%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Ellington Trestle Gray Dining Table. $209.00 Orig. $299.99. Save   $90.99 (30%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . View Details. Portland 5-Piece Pub Dining Set. 6. $289.00 Reg. $399.99. Save   $110.99 (28%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Stratford Farmhouse White Storage Bookcase. 3. $75.00 Orig. $99.99. Save  $24.99 (25%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Just Home Aqua Metal Glass Desk. 8. $49.00 Orig. $69.99. Save  $20.99 (30%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Just Home Black & Silver 3-Shelf Bookcase. $45.00 Orig. $59.99. Save  $14.99 (25%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Black 4-Bin Rolling Cart. 103. $39.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Just Home Black Mesh Office Chair. 68. $49.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Stratford Farmhouse White 5-Drawer Rolling Cart. $49.00 Orig. $69.99. Save  $20.99 (30%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Stratford Rustic Trestle 6-Shelf Standing Desk. 3. $75.00 Orig. $99.99. Save  $24.99 (25%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . View Details. Stratford Rustic Metal Office Stool. $39.00 Orig. $49.99. Save  $10.99 (22%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . View Details. Stratford Farmhouse Gray 5-Shelf Bookcase. 4. $64.99 Reg. $79.99. Save  $15.00 (19%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Just Home Aqua Mesh Swivel Desk Chair. 3. $35.00 Orig. $44.99. Save  $9.99 (22%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Just Home Black & Silver 1-Drawer Desk. 2. $49.00 Orig. $69.99. Save  $20.99 (30%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Just Home Black Geometric Marble Chair Mat. 1. $11.00 Orig. $15.00. Save  $4.00 (27%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Just Home Black & Silver 4-Drawer Cart. 2. $25.00 Orig. $29.99. Save  $4.99 (17%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Just Home Black Grid Chair with Spider Base. $59.00 Orig. $79.99. Save  $20.99 (26%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . View Details. Just Home Aqua & Black 4-Bin Rolling Cart. 1. $29.00 Orig. $39.99. Save  $10.99 (27%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Just Home Gold & Black 5-Shelf Bookcase. 4. $59.00 Orig. $79.99. Save  $20.99 (26%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . View Details. Just Home White & Silver Faux Marble 5-Shelf Bookcase. $59.00 Orig. $79.99. Save  $20.99 (26%). 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . View Details. Granger Dark Gray Faux Leather Living Room Collection. Set Price: $1. 698.98 Orig. $1. 699.97. Save $0.99. . . . . . . . . . View Details. Lane Home Solutions Excursion Java Living Room Sectiona.... 8. $799.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Horizon Living Room Collection. Set Price: $789.98. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . View Details. Signature Design by Ashley Brantano Living Room Collect.... Set Price: $999.98. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . View Details. Sealy LaZe Twin XL 12 Memory Foam Mattress-In-A-Box. 1. $499.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. Mattress Only. . . . . . . . . . Add To Cart. Sealy LaZe Twin 12 Memory Foam Mattress-In-A-Box. $479.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. Mattress Only. . . . . . . . . . Add To Cart. Coolsense Queen 10 Gel Memory Foam Mattress-In-A-Box. $499.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Sealy LaZe King 12 Memory Foam Mattress-In-A-Box. 2. $1. 099.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. Mattress Only. . . . . . . . . . Add To Cart. Sealy LaZe Queen 12 Memory Foam Mattress-In-A-Box. 2. $699.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. Mattress Only. . . . . . . . . . Add To Cart. Wooden Farmhouse Counter Stool. $389.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. 24 Black & Chrome Faux Leather Counter Stool. $329.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Pink 6-Drawer Jewelry Armoire. $439.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Wooden Farmhouse Barstool. $369.99. 15% Off Everything - Buy it Now.  Pick Up In Store! Discount Applied in cart. Online only.**. . . . . . . . . . Add To Cart. Showing 1 - 99 of 224 Products. View 99 More Products. Next. PEOPLE WHO LIKE FURNITURE ALSO VIEWED. Simmons Redding Gray Sofa. Buy Now. Harlow 5-Piece Pub Table & Chair Set. Buy Now. Stonehill Chocolate Brown Motion Sofa. Buy Now. 3-Piece Rustic Occasional Tables. Buy Now. Previous. Next. Want more deals?. Follow Us. Facebook. Twitter. YouTube. Pinterest. Instagram. SHOP DEPARTMENTS. BIG REWARDS. CREDIT CARD. EASY LEASING. MY ACCOUNT. Sign In. Create Account. Order Status. My Wish Lists. Membership Agreement. CUSTOMER CARE. Contact Us. FAQs. Give Us Your Feedback. Return Policy. CA Transparency Act. BIG LOTS CORPORATE. For careers.  Investor Relations and other Big Lots Information.  visit our Corporate Information Site.. Careers. Investors. Community. ©2019 Big Lots Stores.  Inc..  or their affiliates. All rights reserved. Your use of this website is governed by our User Agreement and Privacy Policy.. Don't want to wait? Get it FREE today! Shop now. Search for Kirkland's Products. Search. Kirklands. Favorites. My Account. Shopping Basket. 0. New Arrivals. . . Holiday. . . . Furniture. . . . Art & Wall Decor. . . . Mirrors. . . . Lighting. . . . Home Decor & Pillows. . . . Bed & Bath. . . . Rugs & Curtains. . . . Kitchen & Dining. . . . Outdoor. . . . Gifts. . . . Sale. 15% Off Any Buy Online.  Pick Up In Store Items - Online Only - Use Code: BOPIS15.   Furniture. Finds for Every Home. Whether you're decorating your first home or refreshing a room.  Kirkland's has home furniture for you! Choose extra seating so you can make room for guests.  or pick out pieces to complete the rest of your home. From traditional to transitional to contemporary.  find your new furniture style at Kirkland's!. Living Room. All Living Room Furniture. Accent Chairs. Accent Tables. Benches & Ottomans. Bookshelves. C-Tables. Coffee Tables. Console Tables. Fireplaces. Media Furniture. Sofas & Chaise Lounges. Bedroom Furniture. All Bedroom Furniture. Armoires. Bed & Headboards. Dressers & Chests. Nightstands. Kitchen & Dining Room Furniture. All Kitchen & Dining Room Furniture. Cabinets & Sideboards. Dining Tables & Seating. Dining Sets. Dining Chairs. Stools. Wine Racks. More Rooms. Bathroom Vanities. Entryway Furniture. Office Furniture. Storage Furniture. Kids Furniture. More Ways to Shop. Furniture New Arrivals. Furniture Sale."}